lfcs_oscar_franzen_summary.org
* Intro
These are my notes for the Linux Foundation Certified System administrator
(LFCS) exam. The notes are *not* a complete guide to the exam, but I think
they cover the main topics. I have compiled these notes from multiple sources
freely available on the internet as a summary for myself. References are found
at the bottom of this document. Hopefully this summary is also helpful for
anyone else pursuing LFCS.

Commands have been tested on Ubuntu 19. To be less repetitive, I have omitted
=sudo= from many commands that must be executed as root.

- Oscar Franzén <p.oscar.franzen@gmail.com>
* Basics
- terminal = *tty* = virtual console
- pseudo-ttys = terminal emulators, e.g. Xterm, tmux, etc
- shell = the program you see when you log in, e.g. bash, zsh, sh
- an /inode/ is a data structure on disk that describes and stores file
  attributes and location
** File system layout
+--------+---------------------------------------------+
| Path   | Description                                 |
+--------+---------------------------------------------+
| /bin/  | Essential binaries.                         |
+--------+---------------------------------------------+
| /sbin/ | System binaries.                            |
+--------+---------------------------------------------+
| /usr/  | Contains user applications, package manager,|
|        | files, etc.                                 |
+--------+---------------------------------------------+
| /boot/ | Compressed kernel image (vmlinuz), initramfs|
|        | (initial RAM filesystem, mounted before real|
|        | root filesystem becomes available).         |
+--------+---------------------------------------------+
| /opt/  | Proprietary software or software downloaded |
|        | w/o package managers.                       |
+--------+---------------------------------------------+
| /root/ | Root lives here.                            |
+--------+---------------------------------------------+
| /var/  | Data that change frequently, etc log files, |
|        |mail, transient data cache, lock files.      |
|        |                                             |
+--------+---------------------------------------------+
| /run/  | A pseudo-fs. Transient data.                |
+--------+---------------------------------------------+
| /dev/  | Device files. Represents connected devices. |
+--------+---------------------------------------------+
| /proc/ | Pseudo-filesystem in memory with kernel data|
|        |structures and processes.                    |
+--------+---------------------------------------------+
| /home/ | Contains users' files and directories. But  |
|        |root is /root/                               |
+--------+---------------------------------------------+
** systemd
- an =init= replacement designed to start processes in parallel, it has always
  =pid=1=
- we can see that on Ubuntu, =/sbin/init= points to =/lib/systemd/systemd=
- Emulates "runlevels" for compatibility with old init (=sysvinit=) using
  /targets/
- =runlevel= to display current runlevel
- Change runlevel with =telinit N= where N is the runlevel
- Runlevels:
+----------+----------------------------------+
| Runlevel | Description                      |
+----------+----------------------------------+
|        0 | Halt the system. Runlevel 0 is a |
|          |special transitional state used to|
|          |shutdown the system quickly.      |
+----------+----------------------------------+
|        1 |Maintenance mode used for         |
|          |low-level system maintenance that |
|          |may be impaired by normal system  |
|          |operation.                        |
|          |                                  |
+----------+----------------------------------+
|        2 | The default runlevel (on         |
|          |Debian-based systems).            |
+----------+----------------------------------+
|        3 | Not used on Debian-based systems.|
+----------+----------------------------------+
|        4 | Not used on Debian-based systems.|
+----------+----------------------------------+
|        5 | Not used on Debian-based systems.|
+----------+----------------------------------+
|        6 |Reboot the system.                |
+----------+----------------------------------+
- Runlevel can be changed with =init [0-6]= although this is not the recommended
  way to change runlevel
- =service= is a wrapper for =systemctl= and =service= supports a subset of
  actions. =systemctl= is the main utility for service management.
*** Bash scripting
#+BEGIN_SRC bash
if CONDITION; then 
	COMMANDS;
else
	OTHER-COMMANDS 
fi
#+END_SRC
| Condition        | Evaluates to true when                |
|------------------+---------------------------------------|
| [ -a file ]      | file exists                           |
| [ -d file ]      | file exists and is a directory        |
| [ -f file ]      | file exists and is a regular file     |
| [ -u file ]      | file exists and its SUID bit is set   |
| [ -g file ]      | file exists and its GUID bit is set   |
| [ -k file ]      | file exists and its sticky bit is set |
| [ -r file ]      | file exists and is readable           |
| [ -s file ]      | file exists and it is not empty       |
| [ -w file ]      | file exists and it is writable        |
| [ -x file ]      | file exists and it is executable      |
| [ str1 = str2 ]  | Strings are equal                     |
| [ str1 != str2 ] | Strings are not equal                 |

Integer comparisons
| Condition     | Evaluates to true when                 |
|---------------+----------------------------------------|
| int1 -eq int2 | int2 equals to int2                    |
| int1 -ne int2 | int1 not equal to int2                 |
| int1 -lt int2 | int1 is less than int2                 |
| int1 -le int2 | int1 is less or equal to int2          |
| int1 -gt int2 | int1 is greater than int2              |
| int1 -ge int2 | int1 is grreater than or equal to int2 |

=$?= gives the exit status of the last executed command
** Change lost root password 
1. Press shift at boot
2. In the GRUB menu press 'e'
3. On the line starting with 'linux', change 'ro' to 'rw init=/bin/bash'
4. Press CTRL+X
5. =passwd root=
6. Reboot
