lfcs_oscar_franzen_summary.txt


3 Essential commands
════════════════════

3.1 Help
────────

  Config examples are present in `/usr/share/doc/'.
  ┌────
  │ # compile manual index
  │ mandb
  │ man -k keyword
  │ info command
  └────


3.2 trivial
───────────

  ┌────
  │ whoami
  └────


3.3 root
────────

  Any member of group `wheel' have sudo access.
  ┌────
  │ # inherit user session
  │ su
  │ # fresh session
  │ su -
  │ # login as a different user, "-" is a shortcut for "-login"
  │ su - user
  │ # add to wheel
  │ usermod -aG wheel user
  └────


3.3.1 visudo
╌╌╌╌╌╌╌╌╌╌╌╌

  Used to edit the `/etc/sudoers' file. A line like this gives any
  member of the group `wheel' sudo access:
  ┌────
  │ %wheel ALL = (ALL) ALL
  │ 		   ^ indicate what programs are allowed to run, ALL for all
  │ foobar ALL = (root:root) /sbin/test
  └────


3.4 Showing logged in users and what they are doing
───────────────────────────────────────────────────

  ┌────
  │ w
  └────


3.5 IO redirection
──────────────────

  ┌────
  │ program < input_file
  │ program > output_file
  │ program 2> error_file
  │ program > output_file 2>error_file
  │ echo 'hello world' > file1
  │ # appends a line
  │ echo 'hi again' >> file1
  └────


3.6 Search for files
────────────────────

  ┌────
  │ find / -name "passwd"
  │ find / -name "*passwd*"
  │ # find files named 'zic' that are rwx for u and rx for g and o
  │ # execute echo on each file found
  │ find / -name "zic" -perm 755 -exec echo '{}' \;
  │ # find all files smaller than 100kb
  │ find / -size -100k
  │ find / -maxdepth 3 -type f -size +2M
  │ # find file1 _or_ file2, \ to escape (
  │ find / \( -name file1 -o -name file2 \)
  │ # identify all hard links to the file 'foobar'
  │ # (i.e., finding all files with the same inode)
  │ find / -samefile foobar
  │ # list all files not owner by user 'root'
  │ find / \! -user root
  │ # search case insensitive
  │ find / -iname "PassWd"
  │ # identify files with identical permissions to 222
  │ # 222 = w-rx for ugo
  │ find / -perm 222
  │ # at least permission 222
  │ find / -perm -222
  │ # write for u or write for g or write for o
  │ find / -perm /222
  │ # files accessed at least 24 hours ago
  │ find / -atime +1
  │ # uses a previously constructed database
  │ locate file
  │ # update the database
  │ updatedb
  └────


3.7 Working with files
──────────────────────

3.7.1 The editor `vi'
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
   Command  What it does                            
  ──────────────────────────────────────────────────
   i        Insert mode                             
   ESC      Exit any mode to command mode           
   o        Enter insert mode and insert a new line 
   :wq!     Write and quit                          
   :q!      Quit w/o saving                         
   :w!      Force write                             
   u        Undo                                    
   gg       Go to beginning of file                 
   G        Go to end of file                       
   :/foo    Search for the string "foo"             
   n        Next occurence                          
   N        Previous occurence                      
   :42      Go to line 42                           
   dd       Delete the current line                 
   x        Delete the selected character           
   v        Select text                             
   y        Copy selected text                      
   p        Paste selected text                     
   d        Delete selected text                    
  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━


3.7.2 File globbing
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
   Example        Files and directories it matches 
  ─────────────────────────────────────────────────
   ls -l a*       Beginning with a                 
   ls -l a?       Two characters beginning with a  
   ls -l a[ab]    aa or bb                         
   ls -l a[a-c]   aa, ab or ac                     
   ls -l a[a-c]*  Begin with aa, ab or ac          
  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━


3.7.3 Comparing files
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

◊ 3.7.3.1 diff/diff3

  ┌────
  │ diff file1 file2
  │ # output side by side in two columns
  │ diff -y file1 file2
  │ # compare 3 files line by line
  │ diff3
  └────


3.7.4 uniq - collapse consecutive lines
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ # Compare only first two characters
  │ uniq -w 2 file
  │ # Prefix lines with number of occurences
  │ uniq -c file
  └────


3.7.5 grep
╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ # print the file name of the match
  │ grep -l pattern path
  │ # also search subdirectories of path
  │ grep -lr pattern path
  │ # as above but with case insensitive
  │ grep -lri pattern path
  └────


3.7.6 sed
╌╌╌╌╌╌╌╌╌

  ┌────
  │ sed 's/source/target/' file
  │ sed 's/source/target/g' file
  │ # case inensitive
  │ sed 's/source/target/gi' file
  │ # apply only on row 2
  │ sed '2s/source/target/' file
  │ # print only changed rows
  │ sed -n 's/source/target/p' file
  │ # prints lines 2 to 4
  │ sed -n 2,4p file
  │ # deletes lines with source
  │ sed '/source/d' file
  │ # delete line 12
  │ sed -n 12d file
  │ # insert "hej" on line 5
  │ sed '5ihej' file
  └────


3.7.7 Other commands
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ # sort based on column 2
  │ sort -k 2 file
  │ # cut using one whitespace as delimiter and print column 1 from file
  │ cut -d " " -f1 file
  │ # print columns 1 and 3 from file
  │ cut -d " " -f1.3 file
  │ ls
  │ # long output
  │ ls -l
  │ # show hidden files
  │ ls -la
  │ # recursive
  │ ls -lR
  │ # list by time stamp
  │ ls -lt
  │ # show directory properties and not its content
  │ ls -ld
  │ # shows current directory
  │ pwd
  │ # print file content
  │ cat
  │ tac
  │ # copy file1 and file2 to dest
  │ cp file1 file2 /dest
  │ # recursive
  │ cp -r source/ target/
  │ # rename a file/dir or move it
  │ mv file1 file2
  │ # remove a directory including read only files
  │ rm -rf dir
  │ # makes parent directories if needed
  │ mkdir -p foo/bar
  │ # removes dir (only if dir is empty)
  │ rmdir dir
  │ sed
  │ # estimate space used by a file or dir (default returns size in kb)
  │ du /sbin/
  │ awk
  │ cut
  │ # substitute string1 with string2
  │ tr string1 string2
  │ # substitute repeated occurences of one character with a single one of
  │ # that character
  │ tr -s ' '
  │ paste
  │ # print last 10 lines of file
  │ tail file
  │ # print last 20 lines
  │ tail -n 20 file
  │ # output the tail of the file as it grows
  │ tail -f file
  │ # print first 10 lines of file
  │ head file
  │ # creates an empty file
  │ touch file
  │ # specific timestamp
  │ touch -t YYMMDDhhmm file
  │ patch
  │ sed
  │ awk
  │ # add line numbers
  │ cat <file> | nl
  └────


3.7.8 I-nodes and links
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

◊ 3.7.8.1 Hard links

  More than one file can point to the same i-node. Must be on the same
  device. Cannot be directories.
  ┌────
  │ # creates a hard link
  │ ln target newname
  │ # the inode will be the same for the files
  │ ls -il
  └────


◊ 3.7.8.2 Symbolic links

  Points to a file. If the file is removed the link becomes
  invalid. Symbolic links have different inode numbers.
  ┌────
  │ ln -s target linkname
  │ # create a symbolic link to sbin in the current dir
  │ ln -s /sbin/
  └────


◊ 3.7.8.3 Show inode for a file or dir

  First column shows the i-node number.
  ┌────
  │ ls -li
  └────


3.8 Backup, compression, etc
────────────────────────────

3.8.1 Archiving
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ # make tar.bz2 archive
  │ tar -jcvf file.tar.bz2 *
  │ # uncompress
  │ tar -jxvf file.tar.bz2
  │ # print content of tar file
  │ tar -tf file.tar
  │ # delete a file from a tar file
  │ tar --delete -f test.tar file
  └────


3.8.2 Backups
╌╌╌╌╌╌╌╌╌╌╌╌╌

◊ 3.8.2.1 dd

  The `dd' program is very useful for making copies of raw disk space. A
  common joke with `dd' is that is stands for *data destroyer*, so it
  should be noted that it's a very dangerous utility.

  Write a file containing zeros:
  ┌────
  │ dd if=/dev/zero of=/mnt/drive/foobar bs=2G count=1
  └────


  ◊ 3.8.2.1.1 Create a backup

    The device _must_ be unmounted
    ┌────
    │ dd if=/dev/sda of=/system_images/sda.img
    │ # make a complete copy of one disk onto another
    │ dd if=/dev/sda of=/dev/sdb
    └────


  ◊ 3.8.2.1.2 Restore a backup

    ┌────
    │ dd if=/system_images/sda.img of=/dev/sda
    └────
