lfcs_oscar_franzen_summary.txt


  ◊ 3.8.2.1.3 Copy Master Boot Record (MBR)

    ┌────
    │ # MBR is always stored in the first 512 bytes of the disk
    │ # bs sets the block size, count copies this number of blocks
    │ # bs*count is the amount of data copied
    │ dd if=/dev/sda of=mbr_sda.backup bs=512 count=1
    └────


◊ 3.8.2.2 rsync

  ┌────
  │ rsync -avr source dest
  │ # -z adds compression
  │ rsync -avrz source user@192.168.0.2:~/dest
  │ # use ssh
  │ rsync -avre ssh source user@192.168.0.2:~/dest
  └────


3.9 Permissions
───────────────

3.9.1 Octal representations of permissions
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  Sum represents combinations.
  ━━━━━━━━━━━━━━━━━━━━━━
   Octal  Meaning       
  ──────────────────────
       0  no permission 
       1  x             
       2  w             
       4  r             
       5  rx            
       6  rw            
       7  rwx           
  ━━━━━━━━━━━━━━━━━━━━━━

  ┌────
  │ # change owner
  │ chown
  │ # change group
  │ chgrp
  │ # change permissions
  │ chmod
  │ # example of chmod
  │ chmod u+rwx,g+r,o+r fil
  └────


◊ 3.9.1.1 Examples

  ━━━━━━━━━━━━━━━━━━━━━━━━━
   Octal  Meaning          
  ─────────────────────────
    0666  rw for everyone  
    0777  rwx for everyone 
  ━━━━━━━━━━━━━━━━━━━━━━━━━


3.9.2 setuid, setgid
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  Run a program as the user/group set as owner of the file. Cannot be
  applied to bash scripts.
  ┌────
  │ chmod u+s test
  │ chmod g+s test
  └────


3.9.3 Sticky bit
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  When a directory's sticky bit is set, the filesystem treats the files
  in such directories in a special way so only the file's owner, the
  directory's owner, or root user can rename or delete the file. Without
  the sticky bit set, any user with write and execute permissions for
  the directory can rename or delete contained files, regardless of the
  file's owner. For example `/tmp/' has +t.
  ┌────
  │ chmod +t directory_name
  └────


3.9.4 Extended attributes
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  Metadata associated with files. Extended attributes are not
  interpreted by the file system. Extended attributes consists of
  namespaces. Stored in the /inode/ of the file. ACL uses the `system'
  namespace.

  Examples:
  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
   Flag  Meaning                                                  
  ────────────────────────────────────────────────────────────────
   I     Immutable, no user can change it. No hard links.         
   a     Apppend-only                                             
   A     No-atime-update (access time of the file is not updated) 
  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
  ┌────
  │ lsattr
  │ =chattr [+|-|=mode] filename=
  └────


3.9.5 umask
╌╌╌╌╌╌╌╌╌╌╌

  Can be used to remove permissions from newly created files.
  ┌────
  │ # remove write permissions from newly created files
  │ umask 222
  └────


3.10 Root
─────────

  Sudo file is stored in `/etc/sudoers/' and `/etc/sudoers.d/'.
  ┌────
  │ $ sudo -s
  └────


3.11 Processes and resource limits
──────────────────────────────────

3.11.1 Process types
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  +-----------------+------------------------------------------------+
  | Process type    | Description                                    |
  |                 |                                                |
  +-----------------+------------------------------------------------+
  |   Interactive   |   Need to be started by a user, either at a    |
  |     process     |           command line or through a            |
  |                 |              graphical interface.              |
  +-----------------+------------------------------------------------+
  | Batch Processes | Automatic processes which aree scheduled from  |
  |                 |and then disconnected from the terminal.        |
  +-----------------+------------------------------------------------+
  | Daemons         | Server processes running continuously. Mauny   |
  |                 |launched during system startup.                 |
  +-----------------+------------------------------------------------+
  | Threads         | Lightweight processes that are run under the   |
  |                 |umbrella of a main process.                     |
  +-----------------+------------------------------------------------+
  | Kernel threads  | Kernel tasks that users neither start nor      |
  |                 |terminate and have little control over.         |
  +-----------------+------------------------------------------------+


3.11.2 Useful commands
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ ps
  │ ps -u <username>
  │ pgrep
  │ kill
  │ pkill
  │ # kill all processes owned by group with GID=99
  │ pkill -G 99
  │ # kill all processes whose parent process is 4992
  │ pkill -P 4992
  │ killall
  └────


3.11.3 ulimit
╌╌╌╌╌╌╌╌╌╌╌╌╌

  Used to get or set resource limits.
  ┌────
  │ # see current limits
  │ ulimit -a
  └────


◊ 3.11.3.1 Limit stack size

  When you call a function, a new "namespace" is allocated on the
  stack. That's how functions can have local variables. As functions
  call functions, which in turn call functions, we keep allocating more
  and more space on the stack to maintain this deep hierarchy of
  namespaces.

  To curb programs using massive amounts of stack space, a limit is
  usually put in place via ulimit -s. If we remove that limit via ulimit
  -s unlimited, our programs will be able to keep gobbling up RAM for
  their evergrowing stack until eventually the system runs out of memory
  entirely.

  ┌────
  │ ulimit -s 4096
  └────


3.11.4 Set global resource limits
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  • Done in `/etc/security/limits.conf'
  • Config format:
    ┌────
    │ *    hard    nproc    10
    │ ^ user group or all (*)
    │ 
    │      ^ hard or soft limit
    │ 
    │ 	     ^ whatever should be enforced (number of processes here)
    │ 
    │ 		      ^ the actual limit
    └────


3.12 Inspect library dependencies
─────────────────────────────────

  Use `ldd <command>'.


3.13 Useful utils
─────────────────

3.13.1 tree
╌╌╌╌╌╌╌╌╌╌╌

  Prints tree structure of a directory.
  ┌────
  │ apt-get install tree
  │ tree
  └────


3.14 Locate a program
─────────────────────

  ┌────
  │ which ls
  │ # also locates where man page is (+ source code)
  │ whereis ls
  └────


4 Operation of running systems
══════════════════════════════

4.1 Boot, reboot, shutdown
──────────────────────────

  ┌────
  │ # power off, -h as in halt
  │ shutdown -h now
  │ # reboot
  │ shutdown -r now
  │ # legacy commands
  │ reboot
  │ halt
  │ poweroff
  └────


4.2 Modules
───────────

  • Modules have `*.ko' extensions and are found in
    `/lib/modules/<kernel-version/'
  • `lsmod' lists loaded modules
  • `modprobe' to load module using a database of dependency information
    • Modules can be loaded specifying parameters: `modprobe e1000e
          debug=2 copybreak=256'
    • `/etc/modprobe.d/' contains default parameters applied when
      loading a module with modprobe
    • Module dependencies will be loaded as well
  • `modprobe -r' to unload module
  • `insmod' is another way to load modules directly
  • `rmmod' is another way to unload modules
  • `modinfo' to show details such as version, module dependencies,
    supported hardwares, what parameters can be supploed during loading
    etc.
  • `depmod' to rebuild the module database


4.3 GRand Unified Boot loader (GRUB)
────────────────────────────────────

  • Config is `/etc/default/grub' and if it is modified then run
    `update-grub'
  after (the actual file read by GRUB at boot is `/boot/grub/grub.cfg/',
  but it should not be modified manually).
  • If GRUB is not installed for some reason, install it with
      `grub-install /dev/sdX'


4.4 Manage processes
────────────────────

4.4.1 mpstat
╌╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ apt-get install sysstat
  │ mpstat
  │ # -P to indicate which cpus
  │ # -u for CPU utilization
  │ # 2 second intervals
  │ # 3 reports
  │ mpstat -P ALL -u 2 3
  └────


4.4.2 ps
╌╌╌╌╌╌╌╌

  ━━━━━━━━━━━━━━━━━━━━━━━━━
   Term  Desc              
  ─────────────────────────
   pid   Process id        
