lfcs_oscar_franzen_summary.txt
   ppid  Parent process id 
  ━━━━━━━━━━━━━━━━━━━━━━━━━
  ┌────
  │ # all processes
  │ # BSD style syntax
  │ ps aux
  │ # UNIX style syntax
  │ ps -aux
  │ ps -eo pid,ppid,cmd,%cpu,%mem --sort=-%cpu
  └────
  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
   column   meaning                                                         
  ──────────────────────────────────────────────────────────────────────────
   user     owner                                                           
   pid      process ID                                                      
   %cpu     CPU time divided by the time the process has been running       
   %mem     resident set size divided by memory of the machine              
   VSZ      virtual memory in KiB                                           
   RSS      resident memory in KiB, i.e. non-swapped physical memory        
   tty      attached terminal                                               
   stat     process state                                                   
   start    start time of the process                                       
   time     cumulative CPU time                                             
   command  command, those within [] are system processes of kernel threads 
  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━


4.4.3 /proc/
╌╌╌╌╌╌╌╌╌╌╌╌

  • Processes are actually directories in `/proc/[pid]'
  • Contains current state of each process running
    • Child processes
    • Memory usage
  • `/proc/meminfo'
  • `/proc/sys/'
    • Contains tunable kernel parameters as plain text files
    • Can be changed with `sysctl' (or by writing to files directly)
      • Print kernel setting: `sysctl kernel.pid_max', corresponding to
        `/proc/sys/kernel/pid_max'
      • `sysctl -a' prints all available settings
    • `/etc/sysctl.conf' contains parameters applied during boot, to
      make a change permanent, add it to this file. To apply current
      config without rebooting, run `sysctl -p'


4.4.4 list open files by a process
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ lsof -p [pid]
  └────


4.4.5 Priorities
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  Lower niceness means higher priority. Range is from -20 to 19.
  ┌────
  │ # run a program with modified scheduling priority
  │ nice -n value command
  │ # alter priority of running processes (only root)
  │ renice -n value [pid]
  └────


4.4.6 kill
╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ # send SIGTERM
  │ kill pid
  │ # send SIGKILL
  │ kill -9 pid
  │ # list all available signals
  │ kill -l
  └────


◊ 4.4.6.1 Signals

  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
   Signal   Description                                       
  ────────────────────────────────────────────────────────────
   SIGHUP   Terminate                                         
   SIGINT   Terminate, interrupt from keyboard, CTRL-C        
   SIGFPE   Core dump, sent from kernel                       
   SIGKILL  Terminate, abnormal termination                   
   SIGTERM  Terminate, graceful termination (default in kill) 
   SIGSTOP  Stop, cannot be handled or ignored                
   SIGTSTP  CTRL-Z                                            
   SIGCONT  Continue                                          
   SIGCHLD  Ignore, child stopped                             
   SIGPIPE  Terminate, broken pipe, socket closed             
  ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━


4.4.7 crontab
╌╌╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ crontab -e
  │ # or as root to modify a specific users cron jobs
  │ crontab -e -u user
  └────


4.4.8 at
╌╌╌╌╌╌╌╌

  ┌────
  │ apt-get install at
  │ service atd status
  │ at
  │ atq
  │ atrm
  └────


4.4.9 sar
╌╌╌╌╌╌╌╌╌

  System activity reporter.
  ┌────
  │ # CPU usage report 3 times in intervals of 3 seconds
  │ sudo sar 3 3
  └────


4.4.10 misc
╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ pgrep name
  │ pstree
  │ uptime
  │ strace
  │ free
  │ # mainly for virtual memory stats but also for CPU, process and disk statistics
  │ vmstat
  │ pmap
  │ iotop
  │ iostat
  │ # prioritize a process in io scheduling
  │ ionice
  └────


4.4.11 
╌╌╌╌╌╌╌


4.5 AppArmor
────────────

  • Alternative to SELinux
  • Profile based
  • Two modes:
    1. Enforce
    2. Complain
  ┌────
  │ apt-get install apparmor-profiles
  │ apparmor_status
  │ # put profile in complain mode
  │ aa-complain
  │ # put profile in enforcement mode
  │ aa-enforce
  └────


4.6 Package managers
────────────────────

4.6.1 dpkg
╌╌╌╌╌╌╌╌╌╌

  A low-level package manager. Database is located in `/var/lib/dpkg'.
  ┌────
  │ # list installed packages
  │ dpkg -l
  │ # list installed files from a package
  │ dpkg -L package
  │ # query status of an installed package
  │ dpkg -s package
  │ # list content of deb package
  │ dpkg -c package.deb
  │ # install deb package
  │ dpkg -i package.deb
  │ # remove package
  │ dpkg -r package.deb
  └────


4.6.2 Advanced Packacking Tool (apt)
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  • Based on `dpkg'.
  ┌────
  │ apt-cache search term
  │ apt-cache show pkg
  │ # Show packages whose name starts with prefix
  │ apt-cache pkgnames openjdk
  │ # Search all packages that contains file
  │ apt-file search file
  │ # List all files in the pkg. pkg doesn't need to be installed or fetched
  │ apt-file list pkg
  │ apt-get autoremove
  │ apt-get clean
  │ apt-get update
  │ apt-get install pkg
  │ apt-get [--purge] remove pkg
  │ apt-get upgrade
  └────


5 User and group management
═══════════════════════════

5.1 /etc/passwd
───────────────

  The second field is password, is it has an `x', then passwords are
  managed by `/etc/shadow'. `/etc/passwd' has 644 permissions that means
  anyone can read it. This is because system programs and user apps need
  to read the information in that file. On the other hand, `/etc/shadow'
  has 400 permissions. `/etc/shadow' is preferred way to keep passwords
  as it prevents anyone to read hashed passwords.


5.2 Adding users
────────────────

  ┌────
  │ sudo su
  │ groupadd test
  │ useradd mrtest
  │ useradd mstest
  │ usermod -a -G test mrtest
  │ usermod -a -G test mstest
  │ # lock user account
  │ usermod -L username
  │ # A locked password prevents a user to authenticate with that password, however, user
  │ # can authenticate by other means, e.g. ssh keys etc. Locking an account eliminates to
  │ # authenticate and use that account in any way,
  │ passwd -l username
  │ mkdir /mnt/asdf
  │ touch /mnt/asdf/acl.txt
  │ chgrp -R test /mnt/asdf/
  │ chmod ug+rwx /mnt/asdf
  │ chmod o+rx-w /mnt/asdf
  │ # The point is to give a user access to /mnt/asdf without adding the user to the test group
  │ # since that also gives access to other files.
  │ userdel user
  │ # chage (change user password expiry)
  │ chage <username>
  │ # create system account (default shell should be nologin)
  │ useradd -r -s /usr/sbin/nologin
  └────


5.3 ACL
───────

  • If files inside a directory where a default ACL has been set do not
    have a ACL of their own, they inherit the default ACL of their
    parent directory.


5.3.1 Install `getfacl' and `setfacl':
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  `sudo apt-get install acl'


5.3.2 Check compatibility of the file system with ACL:
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  =tunefs -l /dev/sda2 | grep "Default mount options"


5.3.3 `setfacl -m u:rand:rw /mnt/asdf/test.txt'
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌


5.3.4 `getfacl test.txt'
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌


5.3.5 Set to a directory:
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  `setfacl -m d:o:r /mnt/test/'


5.3.6 Remove all ACL:
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  `setfacl -b /mnt/test/'


5.4 Adding sudo capability for a user
─────────────────────────────────────

  Don't edit /etc/sudoers or /etc/sudoers.d/ directly, rather use
  `visudo', because problems are checked before saving. For example, to
  add `sudo' capability for user "test" add this line:
  ┌────
  │ test ALL=(ALL:ALL) ALL
  └────


5.5 Show which shell is used
────────────────────────────

  ┌────
  │ echo $SHELL
  └────


5.6 Bash restricted shell
─────────────────────────

  Prevents:
  • cd directories
  • changing certain environment variables
  • specify an absolut path in any command
  • IO redirecting
  ┌────
  │ bash -r
  └────
