lfcs_oscar_franzen_summary.org
** Pluggable Authentication Modules (PAM)
- Provides authentication policies in a uniformed and modular way for various
applications. A PAM-aware application invokes libpam which in turn checks these
configuration files to apply rules and invokes PAM modules. PAM integrates
low-level authentication modules into a high-level API that provides dynamic
authentication support for applications. This allows developers to write
applications that require authentication, independently of the underlying
authentication system.
- _To employ PAM, an application/program needs to be “PAM aware“; it needs to have
been written and compiled specifically to use PAM. To find out if a program is
“PAM-aware” or not, check if it has been compiled with the PAM library using
=ldd command=._
- Main config file is =/etc/pam.conf= and =/etc/pam.d/= contain PAM config files
  for each PAM-aware program.
- PAM libraries are found in =/usr/lib/x86_64-linux-gnu/security= (many so files
  here have man pages: =man listfile=)
** Show available shells and who I am
#+BEGIN_SRC bash
cat /etc/shells
echo $USER
#+END_SRC
* Networking
** Basic networking
=ifconfig= is deprecated, use =ip=
*** Show IP address configuration
ip addr show
ip a s
*** set IP using nmgui/nmci
#+BEGIN_SRC bash
nmtui
nmcli # CLI for network manager
#+END_SRC
*** set IP manually
ip link set eth0 down
ip addr add 192.168.0.2/24 dev eth0
ip link set eth0 up
*** set hostname
Modify: /etc/hostname
Show current hostname: hostname
*** Static DNS entries
/etc/hosts
** Installing an ftp server
Install the very secure ftp server and configure it for anonymous access to a specific directory.
1. =sudo apt-get install vsftpd=
2. =sudo service vsftpd start=
3. Config file is =/etc/vsftpd.conf=
   - Create a directory for data (anonymous access will be allowed):
     =sudo mkdir /datamkdir /mnt/asdf/=
4. Modify the config file:
   - =sudo vim /etc/vsftpd.conf=
   - Make sure the settings are:
     #+BEGIN_SRC shell
     anonymous_enable=YES
     anon_root=/data/
     no_anon_password=YES
     write_enable=YES
     local_enable=YES
     #+END_SRC
   - Restrict users to their home directories:
     #+BEGIN_SRC 
     chroot_local_user=YES
     chroot_list_enable=YES
     chroot_list_file=/etc/vsftpd_chroot_list
     #+END_SRC
   - Create an empty file: =touch /etc/vsftpd_chroot_list=
   - Rate limits in kb:
     #+BEGIN_SRC 
     anon_max_rate=10240 # 10 kb
     local_max_rate=20480 # 20 kb
     max_per_ip=5 # 5 connections
     #+END_SRC
   - Restrict data transfers to this port range:
     #+BEGIN_SRC 
     pasv_enable=YES
     pasv_max_port=15500
     pasv_min_port=15000
     #+END_SRC
** Firewall
- The kernel firewall is *NetFilter*
- The utility to manage rules is *iptables*
- A frontend for *iptables* is UncomplicatedFirewall (*ufw*)
**** iptables
#+BEGIN_SRC bash
# list rules
iptables -L
# verbose
iptables -L -v
#+END_SRC
**** ufw
#+BEGIN_SRC bash
ufw allow ssh/tcp
ufw logging on
ufw enable
ufw status
# block all network connections from one IP
ufw deny from 15.15.15.51
# block entire subnet
ufw deny from 15.15.15.0/24
# only for a specific network interface
ufw deny in on eth0 from 15.15.15.51
# allow ssh
ufw allow ssh
# or
ufw allow 22
ufw allow from 15.15.15.0/24 to any port 873
#+END_SRC
** Show ports opened by a process
#+BEGIN_SRC bash
# all processes
netstat -tln 
#+END_SRC
** Routing
Routing IP traffic:
#+BEGIN_SRC bash
ip route show
# or
route -n
# Add route to 192.0.2.1 through 10.0.0.1
ip route add 192.0.2.1 via 10.0.0.1
#+END_SRC

To configure system as route forward must be enabled:
=echo 1 > /proc/sys/net/ipv4/ip_forward=
** Mount NFS share
#+BEGIN_SRC bash
# only client package needed, no need for server components
apt-get install nfs-common
mount -t nfs <IP>:/NameOfShare /mnt/my_mounted_nfs
#+END_SRC

Permanently, by adding line to =/etc/fstab=:
#+BEGIN_SRC bash
IP:/NFS-SHARE/    /mount/point    nfs    defaults    0    0
#+END_SRC
** Running NFS server to share directories
#+BEGIN_SRC bash
apt-get install nfs-kernel-server
#+END_SRC
** Recursive DNS caching server
- =apt-get install bind9 bind9utils=
- =named= is one service within bind, its config is
  =/etc/bind/named.conf.options=, add the following so its within =options {
  ... }=:
 #+BEGIN_SRC bash
 recursion yes;
 # use google name servers as forwarders
 forwarders {
    8.8.8.8;
    8.8.4.4;
 };
 #+END_SRC
- Local zones are configured in =/etc/named.conf.local=, examples:
 #+BEGIN_SRC bash
 # DNS -> IP
 zone "testing.example.com." IN {
     type master;
     file "/etc/bind/db.testing.example.com";
 };
 
 # for reverse DNS, i.e. IP -> DNS
 zone "2.0.10.in-addr.arpa" IN {
     type master;
     file "/etc/bind/2.0.10.in-addr.arpa";
 };
 #+END_SRC
- Content of =/etc/bind/db.testing.example.com=:
 #+BEGIN_SRC bash
 $TTL   604800
 @      IN      SOA    testing.example.com. root.testing.example.com. (
                             3; <-- serial increment
                             ...
                             ...
                             ...
                             ...)
@       IN      NS     ns.testing.example.com.
ns      IN      A      10.0.2.15
web1    IN      A      10.0.2.16
@       IN      AAAA   ::1
 #+END_SRC
- Content of =/etc/bind/2.0.10.in-addr.arpa=:
 #+BEGIN_SRC bash
 ; SOA lines are same as before
 @      IN      NS     ns.testing.example.com.
 15     IN      PTR    ns.testing.example.com.
 16     IN      PTR    web1.testing.example.com.
 #+END_SRC
- Use =named-checkzone= to check for errors
- Restart bind: =service bind9 restart=
- Don't forget to change name server on the system to try it (or use =dig @IP
  domain=)
* Storage configuration
- SSD naming schjeme is =/dev/nvme{order}n{ns}p{part}= where ={order}= is the
  disk order number, ={ns}= is the namespace, and ={part}= is the partition
  number.
- =blkid= can be used to identify block device attributes.
- =lsblk= lists all block devices found.
  =lsblk -f= prints file system type and UUID
** Partioning
- Partitions can be MBR or GPT
  - Limit of maximum 4 partitions with MBR
  - Limit of maximum 128 partitions with GPT
- For MBR, an extended partition is a normal partition that has been divided
  into multiple logic partitions so that it is possible to have more than four
  partitions. Only *one* extended partition can be present.
- For creating MBR, use =fdisk=, for GPT use =parted= (can also create MBR) or
  =gdisk=.
#+BEGIN_SRC bash
fdisk
# list all partitions
fdisk -l
parted -l
#+END_SRC
** File systems
Applications do not access the physical disk directly. Instead, application code
access data contents by file names which is an abstraction by the filesystem.
Every file is associated with an inode. inode is a datastructures that holds
following metadata about the file:
*** Examples
- ext3
- ext4
- btrfs
- xfs
- vfat (non-Linux)
- ntfs (non-Linux)
- hfs (non-Linux)
Available file system creation utilities: =ls -l /sbin/mkfs*=
*** tune2fs
Tune ext file system parameters such as:
- maximum mount count before =fsck= is called
- time interval between =fsck= 
- =tune2fs -l <dev-node>= to see all parameters that can be updated.
** Mounting
UUIDs are reliable because they are unique and consistent. Filesystem UUIDs are
generated when creating (format) a filesystem.
#+BEGIN_SRC bash
mount filesystem_uuid /mount-point
mount partition_label /mount-point
# List all mounted filesystems
mount -l
#+END_SRC
