lfcs_oscar_franzen_summary.txt


5.7 Pluggable Authentication Modules (PAM)
──────────────────────────────────────────

  • Provides authentication policies in a uniformed and modular way for
    various
  applications. A PAM-aware application invokes libpam which in turn
  checks these configuration files to apply rules and invokes PAM
  modules. PAM integrates low-level authentication modules into a
  high-level API that provides dynamic authentication support for
  applications. This allows developers to write applications that
  require authentication, independently of the underlying authentication
  system.
  • _To employ PAM, an application/program needs to be “PAM aware“; it
    needs to have
  been written and compiled specifically to use PAM. To find out if a
  program is “PAM-aware” or not, check if it has been compiled with the
  PAM library using `ldd command'._
  • Main config file is `/etc/pam.conf' and `/etc/pam.d/' contain PAM
    config files for each PAM-aware program.
  • PAM libraries are found in `/usr/lib/x86_64-linux-gnu/security'
    (many so files here have man pages: `man listfile')


5.8 Show available shells and who I am
──────────────────────────────────────

  ┌────
  │ cat /etc/shells
  │ echo $USER
  └────


6 Networking
════════════

6.1 Basic networking
────────────────────

  `ifconfig' is deprecated, use `ip'


6.1.1 Show IP address configuration
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ip addr show ip a s


6.1.2 set IP using nmgui/nmci
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ┌────
  │ nmtui
  │ nmcli # CLI for network manager
  └────


6.1.3 set IP manually
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  ip link set eth0 down ip addr add 192.168.0.2/24 dev eth0 ip link set
  eth0 up


6.1.4 set hostname
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  Modify: /etc/hostname Show current hostname: hostname


6.1.5 Static DNS entries
╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  /etc/hosts


6.2 Installing an ftp server
────────────────────────────

  Install the very secure ftp server and configure it for anonymous
  access to a specific directory.
  1. `sudo apt-get install vsftpd'
  2. `sudo service vsftpd start'
  3. Config file is `/etc/vsftpd.conf'
     • Create a directory for data (anonymous access will be allowed):
       `sudo mkdir /datamkdir /mnt/asdf/'
  4. Modify the config file:
     • `sudo vim /etc/vsftpd.conf'
     • Make sure the settings are:
       ┌────
       │ anonymous_enable=YES
       │ anon_root=/data/
       │ no_anon_password=YES
       │ write_enable=YES
       │ local_enable=YES
       └────
     • Restrict users to their home directories:
       ┌────
       │ chroot_local_user=YES
       │ chroot_list_enable=YES
       │ chroot_list_file=/etc/vsftpd_chroot_list
       └────
     • Create an empty file: `touch /etc/vsftpd_chroot_list'
     • Rate limits in kb:
       ┌────
       │ anon_max_rate=10240 # 10 kb
       │ local_max_rate=20480 # 20 kb
       │ max_per_ip=5 # 5 connections
       └────
     • Restrict data transfers to this port range:
       ┌────
       │ pasv_enable=YES
       │ pasv_max_port=15500
       │ pasv_min_port=15000
       └────


6.3 Firewall
────────────

  • The kernel firewall is *NetFilter*
  • The utility to manage rules is *iptables*
  • A frontend for *iptables* is UncomplicatedFirewall (*ufw*)


◊ 6.3.0.1 iptables

  ┌────
  │ # list rules
  │ iptables -L
  │ # verbose
  │ iptables -L -v
  └────


◊ 6.3.0.2 ufw

  ┌────
  │ ufw allow ssh/tcp
  │ ufw logging on
  │ ufw enable
  │ ufw status
  │ # block all network connections from one IP
  │ ufw deny from 15.15.15.51
  │ # block entire subnet
  │ ufw deny from 15.15.15.0/24
  │ # only for a specific network interface
  │ ufw deny in on eth0 from 15.15.15.51
  │ # allow ssh
  │ ufw allow ssh
  │ # or
  │ ufw allow 22
  │ ufw allow from 15.15.15.0/24 to any port 873
  └────


6.4 Show ports opened by a process
──────────────────────────────────

  ┌────
  │ # all processes
  │ netstat -tln 
  └────


6.5 Routing
───────────

  Routing IP traffic:
  ┌────
  │ ip route show
  │ # or
  │ route -n
  │ # Add route to 192.0.2.1 through 10.0.0.1
  │ ip route add 192.0.2.1 via 10.0.0.1
  └────

  To configure system as route forward must be enabled: `echo 1 >
  /proc/sys/net/ipv4/ip_forward'


6.6 Mount NFS share
───────────────────

  ┌────
  │ # only client package needed, no need for server components
  │ apt-get install nfs-common
  │ mount -t nfs <IP>:/NameOfShare /mnt/my_mounted_nfs
  └────

  Permanently, by adding line to `/etc/fstab':
  ┌────
  │ IP:/NFS-SHARE/    /mount/point    nfs    defaults    0    0
  └────


6.7 Running NFS server to share directories
───────────────────────────────────────────

  ┌────
  │ apt-get install nfs-kernel-server
  └────


6.8 Recursive DNS caching server
────────────────────────────────

  • `apt-get install bind9 bind9utils'
  • `named' is one service within bind, its config is
    `/etc/bind/named.conf.options', add the following so its within
    `options { ... }':
    ┌────
    │ recursion yes;
    │ # use google name servers as forwarders
    │ forwarders {
    │    8.8.8.8;
    │    8.8.4.4;
    │ };
    └────
  • Local zones are configured in `/etc/named.conf.local', examples:
    ┌────
    │ # DNS -> IP
    │ zone "testing.example.com." IN {
    │     type master;
    │     file "/etc/bind/db.testing.example.com";
    │ };
    │ 
    │ # for reverse DNS, i.e. IP -> DNS
    │ zone "2.0.10.in-addr.arpa" IN {
    │     type master;
    │     file "/etc/bind/2.0.10.in-addr.arpa";
    │ };
    └────
  • Content of `/etc/bind/db.testing.example.com':
    ┌────
    │  $TTL   604800
    │  @      IN      SOA    testing.example.com. root.testing.example.com. (
    │ 			     3; <-- serial increment
    │ 			     ...
    │ 			     ...
    │ 			     ...
    │ 			     ...)
    │ @       IN      NS     ns.testing.example.com.
    │ ns      IN      A      10.0.2.15
    │ web1    IN      A      10.0.2.16
    │ @       IN      AAAA   ::1
    └────
  • Content of `/etc/bind/2.0.10.in-addr.arpa':
    ┌────
    │ ; SOA lines are same as before
    │ @      IN      NS     ns.testing.example.com.
    │ 15     IN      PTR    ns.testing.example.com.
    │ 16     IN      PTR    web1.testing.example.com.
    └────
  • Use `named-checkzone' to check for errors
  • Restart bind: `service bind9 restart'
  • Don't forget to change name server on the system to try it (or use
      `dig @IP domain')


7 Storage configuration
═══════════════════════

  • SSD naming schjeme is `/dev/nvme{order}n{ns}p{part}' where `{order}'
    is the disk order number, `{ns}' is the namespace, and `{part}' is
    the partition number.
  • `blkid' can be used to identify block device attributes.
  • `lsblk' lists all block devices found.  `lsblk -f' prints file
    system type and UUID


7.1 Partioning
──────────────

  • Partitions can be MBR or GPT
    • Limit of maximum 4 partitions with MBR
    • Limit of maximum 128 partitions with GPT
  • For MBR, an extended partition is a normal partition that has been
    divided into multiple logic partitions so that it is possible to
    have more than four partitions. Only *one* extended partition can be
    present.
  • For creating MBR, use `fdisk', for GPT use `parted' (can also create
    MBR) or `gdisk'.
  ┌────
  │ fdisk
  │ # list all partitions
  │ fdisk -l
  │ parted -l
  └────


7.2 File systems
────────────────

  Applications do not access the physical disk directly. Instead,
  application code access data contents by file names which is an
  abstraction by the filesystem.  Every file is associated with an
  inode. inode is a datastructures that holds following metadata about
  the file:


7.2.1 Examples
╌╌╌╌╌╌╌╌╌╌╌╌╌╌

  • ext3
  • ext4
  • btrfs
  • xfs
  • vfat (non-Linux)
  • ntfs (non-Linux)
  • hfs (non-Linux)
  Available file system creation utilities: `ls -l /sbin/mkfs*'


7.2.2 tune2fs
╌╌╌╌╌╌╌╌╌╌╌╌╌

  Tune ext file system parameters such as:
  • maximum mount count before `fsck' is called
  • time interval between `fsck'
  • `tune2fs -l <dev-node>' to see all parameters that can be updated.


7.3 Mounting
────────────

  UUIDs are reliable because they are unique and consistent. Filesystem
  UUIDs are generated when creating (format) a filesystem.
  ┌────
  │ mount filesystem_uuid /mount-point
  │ mount partition_label /mount-point
  │ # List all mounted filesystems
  │ mount -l
  └────
