lfcs_oscar_franzen_summary.org
** Fix file system errors
- Should only be run on unmounted file systems
- Main utility: =fsck= (files recovered by this program are placed in the
  =lost+found= directory at the root of the file system)
- The easiest way to force a check of the filesystem on next reboot is to create
  a file =/forcefsck= at the filesystem
** df
#+BEGIN_SRC bash
# -T adds "Type" column
df -hT
#+END_SRC
** Encrypted partition
Options are dm-crypt and Linux Unified Key Setup (LUKS). LUKS is more secure
(according to =info cryptsetup=).
#+BEGIN_SRC bash
apt-get install cryptsetup
# setup a partition
cryptsetup luksFormat /dev/sdb1
# initializes the volume, and sets an initial key or passphrase
cryptsetup luksOpen /dev/sdb1 testing
# You can see a mapping name /dev/mapper/testing
ls -l /dev/mapper/testing
cryptsetup -v status testing
# Create a file system
mkfs.ext4 /dev/mapper/testing
# Mount
mount -t ext4 /dev/mapper/testing /mnt/point
# Unmount
umount /mnt/point
cryptsetup luksClose /dev/mapper/testing
#+END_SRC
*** Mount at boot
To mount an encrypted partition at boot time, add a normal entry to
=/etc/fstab=. =/etc/fstab= is not aware that device is encrypted.
1. Make entry in =/etc/fstab=:
 #+BEGIN_SRC bash
 /dev/mapper/testing /media/enc ext4 defaults 0 2
 #+END_SRC
2. Make entry in =/etc/crypttab=. If key-file is omitted, secret will be asked
   from the console.
 #+BEGIN_SRC bash
 testing /dev/sda1 luks-secret-file
 # or specify the fourth field as "none" to prompt for passphrase
 # interactively from console
 testing /dev/sda1 none luks
 #+END_SRC
*** Encrypt a swap device
Data written to the swap device can contain sensitive information, and as such
it is important to consider security.
1. Find out the partition that is currently being used for swap, then deactivate
   it:
   #+BEGIN_SRC bash
   cat /proc/swap
   #+END_SRC
2. swapoff /dev/sda2
3. Format:
 #+BEGIN_SRC bash
 cryptsetup luksFormat /dev/sda2
 cryptsetup luksOpen /dev/sda2 swapcrypt
 #+END_SRC
4. Make it swap
 #+BEGIN_SRC bash
 mkswap /dev/mapper/swapcrypt
 #+END_SRC
5. Test it
 #+BEGIN_SRC bash
 swapon /dev/mapper/swapcrypt
 cat /proc/swaps
 #+END_SRC
6. Add entry to =/etc/crypttab=
 #+BEGIN_SRC bash
 swapcrypt /dev/sda2 /dev/urandom swap,cipher=aes-cbc-essiv:sha256,size=256
 #+END_SRC
7. Add entry to =/etc/fstab=
 #+BEGIN_SRC bash
 /dev/mapper/swapcrypt none swap defaults 0 0
 #+END_SRC
** Swap space
Virtual memory can make Linux function as if it has more memory than it
physically has, and works in two ways:
1. Many programs don't use all the memory they have permission to use. This is
   because child processes are created using copy-on-write (COW) and only gets a
   new page of memory if there is a change.
2. Memory can be swapped to disk when inactive and only recalled when needed
   again.
#+BEGIN_SRC bash
mkswap /dev/sdX1
swapon /dev/sdX1
swapoff
cat /proc/swaps
#+END_SRC
Add entry to =/etc/fstab=:
#+BEGIN_SRC bash
/dev/sdX1 swap swap sw 0 0
#+END_SRC
** Quota
Disk quotas control maximum space particular users can have on the disk. Quotas
are based per filesystem basis. There are limits on number of blocks and
inodes. These limits are expressed as *soft* and *hard* limits. Hard limits can
never be exceeded. _Soft limits can be exceeded for a grace period_.
*** Creating quotas
1. Install:
 #+BEGIN_SRC bash
 apt-get install quota
 #+END_SRC
2. File systems must be mounted with the =usrquota= or =grpquota= options.
 #+BEGIN_SRC bash
 mount -o usrquota /dev/sdxN /mount-point
 #+END_SRC
3. Generate quota accounting files (stored in root of quoted filesystem):
 #+BEGIN_SRC bash
 quotacheck -v /media/
 #+END_SRC
 =quotacheck= is also used to update quotas.
4. Turn on quotas:
 #+BEGIN_SRC bash
 # -u = user quotas, the default (can be omitted)
 quotaon -vu /media/usb
 #+END_SRC
5. Set up quotas per user or group:
 #+BEGIN_SRC bash
 edquota user
 #+END_SRC
6. To change grace period (editor will launch):
 #+BEGIN_SRC bash
 edquota -t
 #+END_SRC
7. To query quota information of current user:
 #+BEGIN_SRC bash
 quota
 #+END_SRC
*** Turn quotas off
#+BEGIN_SRC bash
quotaoff
#+END_SRC
** RAID
- Redundant Array of Independenty Disks (RAID), spreads I/O over multiple disks
- Can be hardware or software (part of the kernel)
- With hardware RAID, the OS is unaware that RAID is in use
- If hardware controller fails, an identical one must be used; however, in
  software RAID the same disks can be attached to any controller for lower- to
  mid-range hardware.
+------+------------------------------------------------------+
|Level | Description                                          |
+------+------------------------------------------------------+
|     0| No data spreading across disks. No redundancy.       |
+------+------------------------------------------------------+
|     1| Mirroring. Each disk has a duplicate.                |
+------+------------------------------------------------------+
|     5|Rotating parity stripe. A single drive failure does   |
|      |not cause data loss.                                  |
+------+------------------------------------------------------+
|     6| Can handle loss of two disks.                        |
+------+------------------------------------------------------+
|    10| Can be seen as RAID 1+0.                             |
+------+------------------------------------------------------+
*** Configure software RAID
1. Create partitions on each disk
2. Create a RAID device:
 #+BEGIN_SRC bash
 apt-get install mdadm
 mdadm --create /dev/md0 --level=5 --raid-devices=4 /dev/sdb /dev/sdc /dev/sdd /dev/sde
 #+END_SRC
3. Format RAID device:
 #+BEGIN_SRC bash
 mkfs.ext4 /dev/md0
 #+END_SRC
4. Make it persistent, such that after a reboot the RAID array will reform:
 #+BEGIN_SRC bash
 mdadm --detail --scan >> /etc/mdadm/mdadm.conf
 #+END_SRC
5. Update =/etc/fstab=:
 #+BEGIN_SRC bash
 echo -e "/dev/md0\t/mnt/raid5-md0\text4\tdefaults\t0\t0" >> /etc/fstab
 #+END_SRC
6. Mount the RAID device:
 #+BEGIN_SRC bash
 mkdir /mnt/raid5-md0
 mount /dev/md0 /mnt/raid5-md0
 #+END_SRC
7. Examine RAID status:
 #+BEGIN_SRC bash
 cat /proc/mdstat
 #+END_SRC
8. The raid device can be stopped using:
 #+BEGIN_SRC bash
 mdadm -S /dev/md0
 #+END_SRC
9. Monitoring of the device can be done with:
 #+BEGIN_SRC bash
 mdadm --detail /dev/md0
 cat /proc/mdstat
 #+END_SRC
10. Edit =/etc/mdadm/mdadm.conf= and change =MAILADDR root= to =MAILADDR
    any@email.domain=
