lfcs_oscar_franzen_summary.org
** Create logical volumes
LVM groups one or more physical volumes into volume groups, which can be
sub-divided into logical volumes, which mimic nominal disk partitions.

The steps are:
1. create partitions using fdisk
2. Install tools:
 #+BEGIN_SRC bash
 apt-get install lvm2
 #+END_SRC
3. Initialize physical volumes for use by LVM:
 #+BEGIN_SRC bash
 pvcreate /dev/sdb1
 pvcreate /dev/sdb2
 #+END_SRC
4. Merge sdb1 and sdb2 into one group:
 #+BEGIN_SRC bash
 vgcreate vg0 /dev/sdb1 /dev/sdc1
 #+END_SRC
5. Create the logical volume:
 #+BEGIN_SRC bash
 lvcreate --size 350M --name lv1 vg0
 #+END_SRC
6. Display physical volumes:
 #+BEGIN_SRC bash
 pvdisplay
 #+END_SRC
7. Display logical volumes:
 #+BEGIN_SRC bash
 lvdisplay
 #+END_SRC
8. Logical volumes are now in =/dev/vg0/lv*=
9. Format and mount
 #+BEGIN_SRC bash
 mkfs.ext4 /dev/vg0/lv0
 mkdir /mnt/lv0
 mount -t ext4 /dev/vg0/lv0 /mnt/lv0
 #+END_SRC
10. =df -h=
11. Add to =/etc/fstab=
12. Add another physical volume to the logical:
 #+BEGIN_SRC bash
 vgextend vg0 /dev/sdc1
 lvextend --size +100M /dev/vg0/lv0
 lvreduce --size 100M /dev/vg0/lv0
 #+END_SRC
When resizing volumes it is useful to create a snapshot of logical volumes with
the =lvcreate -s= or =lvcreate --snapshot= switch to ensure that data is not
lost. To do so there must be enough room on the volume group first. The
following is a demonstration of a snapshot for =lv0=:
#+BEGIN_SRC bash
lvcreate --size 100M --snapshot --name l-vol0-snapshot /dev/vg0/lv0
#+END_SRC
* Virtualization
1. Install virtualization tools:
 #+BEGIN_SRC bash
 apt-get install qemu-kvm virtinst
 virt-install
 virsh
 #+END_SRC
* Additional
- =mkfifo= (named pipes)
- review =vim=
- see man page of =touch=
- compare binary files: =cmp=
- =md5sum=
- Check primary language of a system
 #+BEGIN_SRC bash
 echo $LANGUAGE
 echo $LANG
 #+END_SRC
- Print all environmental variables
 #+BEGIN_SRC bash
 env
 printenv
 #+END_SRC
* References
- https://training.linuxfoundation.org/certification/linux-foundation-certified-sysadmin-lfcs/
- http://www.obriain.com/training/LFCS/LFCS_v1.5.pdf
- https://github.com/jjberrow/LFCS_Study_Guide/
- https://github.com/simonesavi/lfcs
- https://github.com/ttwd80/lfcs/tree/master/domains
- https://github.com/karakays/lfcs
- https://www.tecmint.com/category/lfcs/
- https://stackoverflow.com/questions/14471564/what-does-ulimit-s-unlimited-do
- https://www.tecmint.com/category/lfcs/
