lfcs_oscar_franzen_summary.txt


7.10 Create logical volumes
───────────────────────────

  LVM groups one or more physical volumes into volume groups, which can
  be sub-divided into logical volumes, which mimic nominal disk
  partitions.

  The steps are:
  1. create partitions using fdisk
  2. Install tools:
     ┌────
     │ apt-get install lvm2
     └────
  3. Initialize physical volumes for use by LVM:
     ┌────
     │ pvcreate /dev/sdb1
     │ pvcreate /dev/sdb2
     └────
  4. Merge sdb1 and sdb2 into one group:
     ┌────
     │ vgcreate vg0 /dev/sdb1 /dev/sdc1
     └────
  5. Create the logical volume:
     ┌────
     │ lvcreate --size 350M --name lv1 vg0
     └────
  6. Display physical volumes:
     ┌────
     │ pvdisplay
     └────
  7. Display logical volumes:
     ┌────
     │ lvdisplay
     └────
  8. Logical volumes are now in `/dev/vg0/lv*'
  9. Format and mount
     ┌────
     │ mkfs.ext4 /dev/vg0/lv0
     │ mkdir /mnt/lv0
     │ mount -t ext4 /dev/vg0/lv0 /mnt/lv0
     └────
  10. `df -h'
  11. Add to `/etc/fstab'
  12. Add another physical volume to the logical:
      ┌────
      │ vgextend vg0 /dev/sdc1
      │ lvextend --size +100M /dev/vg0/lv0
      │ lvreduce --size 100M /dev/vg0/lv0
      └────
  When resizing volumes it is useful to create a snapshot of logical
  volumes with the `lvcreate -s' or `lvcreate --snapshot' switch to
  ensure that data is not lost. To do so there must be enough room on
  the volume group first. The following is a demonstration of a snapshot
  for `lv0':
  ┌────
  │ lvcreate --size 100M --snapshot --name l-vol0-snapshot /dev/vg0/lv0
  └────


8 Virtualization
════════════════

  1. Install virtualization tools:
     ┌────
     │ apt-get install qemu-kvm virtinst
     │ virt-install
     │ virsh
     └────


9 Additional
════════════

  • `mkfifo' (named pipes)
  • review `vim'
  • see man page of `touch'
  • compare binary files: `cmp'
  • `md5sum'
  • Check primary language of a system
    ┌────
    │ echo $LANGUAGE
    │ echo $LANG
    └────
  • Print all environmental variables
    ┌────
    │ env
    │ printenv
    └────


10 References
═════════════

  • [https://training.linuxfoundation.org/certification/linux-foundation-certified-sysadmin-lfcs/]
  • [http://www.obriain.com/training/LFCS/LFCS_v1.5.pdf]
  • [https://github.com/jjberrow/LFCS_Study_Guide/]
  • [https://github.com/simonesavi/lfcs]
  • [https://github.com/ttwd80/lfcs/tree/master/domains]
  • [https://github.com/karakays/lfcs]
  • [https://www.tecmint.com/category/lfcs/]
  • [https://stackoverflow.com/questions/14471564/what-does-ulimit-s-unlimited-do]
  • [https://www.tecmint.com/category/lfcs/]
